EJEMPLO FE Y POS/NotaDebitoValidacionPrevia.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soap="http://webservice.simba.co/">
	<soapenv:Header/>
	<soapenv:Body>
		<soap:EnviarDocumentoElectronico>     
			<!-- A continuación se dejará una serie de comentarios indicando que ha cambiado o se implementó en el campo desde validación previa. 
					Se deja un tipo de cambio para identificar el ajuste que se debe realizar.
					
					Descripción de uso: Significa que es un campo nuevo requerido para validación previa. 
					Cambian códigos: Significa que la DIAN cambio la lista de códigos que informaba en el campo.
					Nueva validación: Significa que el campo ya existe desde el 2242, pero ahora tiene una condición o forma de informar el campo. 
					Eliminar: Era un campo necesario en el 2242, ahora ya no tiene validación.
					
					Todo lo relacionado a como complementar o entender la función del campo se encontrará en el documento (DEV-FEL-048-ImplementacionValidacionPrevia), 
					donde se específica toda la información de las reglas y notificaciones que puede generar validación previa. Además tiene un enlace a los nuevos códigos
					utilizados para cada campo. Por lo tanto con cada comentario por favor dirigirse al documento y con el título (Se encuentra después del tipo de cambio) 
					podrá encontrar las descripciones para pasar a validación previa.

					-->
			<objetoDocumento>
				<Parametros>
					<NombreSistemaEmisor>PruebaSimbaSistema</NombreSistemaEmisor>
					<TipoAmbiente>2</TipoAmbiente>
					<TokenEmpresa>[Token Empresa]</TokenEmpresa>
					<VersionDocElectronico>4.0</VersionDocElectronico>		<!-- Descripción de uso: Es la versión del documento eletrónico que se utiliza. Debe contener el literal "4.0" -->
					<VersionSistemaEmisor>1.2.0.12</VersionSistemaEmisor>	<!-- Descripción de uso: Es la versión del sistema que envía la petición. (Varía por cliente) -->
					<ModoRespuesta>1</ModoRespuesta>						<!-- Descripción de uso: Es la forma en que se recibirá la respuesta. Por ahora dejar código en 1 -->
					<PasswordEmpresa>Bogota18*</PasswordEmpresa>
					<TipoReporte>1</TipoReporte>
					<ContactoReceptor>
						<CorreoElectronico>dlancheros@simba.co</CorreoElectronico>
						<IdEtiquetaUbicacionCorreo>1</IdEtiquetaUbicacionCorreo>
					</ContactoReceptor>
					<ContactoReceptor>
						<CorreoElectronico>jvillegas@stone.com.co</CorreoElectronico>
						<IdEtiquetaUbicacionCorreo>2</IdEtiquetaUbicacionCorreo>
					</ContactoReceptor>
				</Parametros>
				<Encabezado>
					<TipoDocElectronico>2</TipoDocElectronico>
					<IdPersonalizacion>10</IdPersonalizacion><!-- Descripción de uso en: Tipo de operación -->
					<PrefijoDocumento>SETP</PrefijoDocumento>
					<NumeroDocumento>992160005</NumeroDocumento>
					<FechaYHoraDocumento>2019-07-29T00:00:00.000-05:00</FechaYHoraDocumento><!-- Nueva validación: Fecha de emisión -->
					<CodigoMoneda>COP</CodigoMoneda>	<!-- Nueva validación: Moneda del documento -->
					<CantidadLineas>1</CantidadLineas>	<!-- Nueva validación: Cantidad de líneas -->
					<RespuestaMotivoNota>				<!-- Nueva validación: Concepto de correción para notas. -->
						<IdReferencia>SETP3</IdReferencia>
						<CodRespuesta>6</CodRespuesta>	<!-- Nueva validación: Concepto de correción para notas. -->
						<Descripcion>Descripcion nota</Descripcion>
					</RespuestaMotivoNota>
				</Encabezado>
				<Terceros>
					<TerceroProveedorContable>
						<IdAdicional>1</IdAdicional>
						<Tercero>
							<NombreTercero>NOMBRE COMERCIAL PROVEEDOR</NombreTercero>
							<CodigoClasificacionIndustria>223123</CodigoClasificacionIndustria><!-- Descripción de uso en: Actividad económica -->
							<UbicacionFisica>
								<Direccion>
									<Id>05125</Id>				<!-- Nueva validación: Dirección - Listas DANE -->
									<Departamento>ANTIOQUIA</Departamento>
									<Ciudad>MEDELLIN</Ciudad>	<!-- Nueva validación: Dirección - Listas DANE -->
									<SubdivisionPais>Antioquia</SubdivisionPais>		<!-- Nueva validación: Dirección - Listas DANE -->
									<SubdivisionPaisCodigo>05</SubdivisionPaisCodigo>	<!-- Nueva validación: Dirección - Listas DANE -->
									<ZonaPostal>050011</ZonaPostal>						<!-- Nueva validación: Zona postal -->
									<LineaDireccion>
										<TextoLinea>Calle 94 A, N° 11 A-32 Oficina 203</TextoLinea><!-- Nueva validación: Linea dirección -->
									</LineaDireccion>
									<Pais><!-- Cambia nombre: En el 2242 se denominaba "Country", ahora es País. -->
										<Codigo>CO</Codigo>
										<Nombre IdLenguaje="es">Colombia</Nombre><!-- Nueva validación: País -->
									</Pais>
								</Direccion>
							</UbicacionFisica>
							<EsquemaTributarioTercero>
								<NombreRegistrado>RAZON SOCIAL PROVEEDOR S.A.S.</NombreRegistrado><!-- Nueva validación: Razón social Tercero -->
								<NumeroIdTributario SmaIdCodigo="1" SmaIdNombre="31">123465789</NumeroIdTributario><!-- Nueva validación: 	Documento de identificación - Numero
																																			Documento de identificación - DV
																																			Documento de identificación - Tipo -->
																																			
								<NivelTributario ListaNombre="04">O-11;O-06</NivelTributario><!-- Nueva validación: 	Responsabilidades fiscales
																														Régimen tributario -->
								<EsquemaTributario>		<!-- Nueva validación: Esquema tributario Tercero -->
									<Id>01</Id>			<!-- Nueva validación: Esquema tributario Tercero -->
									<Nombre>IVA</Nombre><!-- Nueva validación: Esquema tributario Tercero -->
								</EsquemaTributario>
								<DireccionParaImpuestos><!-- Nueva validación: Dirección para impuestos -->
									<Id>05125</Id>
									<Departamento>ANTIOQUIA</Departamento>
									<Ciudad>MEDELLIN</Ciudad>
									<SubdivisionPais>Antioquia</SubdivisionPais>
									<SubdivisionPaisCodigo>05</SubdivisionPaisCodigo>
									<ZonaPostal>050011</ZonaPostal>
									<LineaDireccion>
										<TextoLinea>Calle 94 A, N° 11 A-32 Oficina 203</TextoLinea>
									</LineaDireccion>
									<Pais>
										<Codigo>CO</Codigo>
										<Nombre IdLenguaje="es">Colombia</Nombre>
									</Pais>
								</DireccionParaImpuestos>
							</EsquemaTributarioTercero>
							<EntidadLegalTercero>
								<NumeroIdLegal SmaIdCodigo="1" SmaIdNombre="31">123465789</NumeroIdLegal><!-- Nueva validación: 	Documento de identificación - Numero
																																	Documento de identificación - DV
																																	Documento de identificación - Tipo -->
																																	
								<NombreRegistrado>RAZON SOCIAL PROVEEDOR S.A.S.</NombreRegistrado><!-- Nueva validación: Razón social Tercero -->
								
								<EsquemaRegistroCorporativo>	<!-- Nueva validación: Registro corporativo Tercero -->
									<Id>SETP</Id>				<!-- Nueva validación: Registro corporativo Tercero -->
									<Nombre>6201</Nombre>		<!-- Nueva validación: Registro corporativo Tercero -->
								</EsquemaRegistroCorporativo>
							</EntidadLegalTercero>
							<Contacto>
								<Nombre>BEATRIZ ELENA VILLADA YEPES</Nombre>
								<Telefono>1234567</Telefono>
								<Email>idiaz@stone.com.co</Email>
							</Contacto>
						</Tercero>
					</TerceroProveedorContable>
					<TerceroClienteContable>
						<IdAdicional>1</IdAdicional>
						<Tercero>
							<IdTercero SmaIdCodigo="6" SmaIdNombre="31">804016671</IdTercero><!-- Nueva validación: 	Documento de identificación - Numero
																														Documento de identificación - DV
																														Documento de identificación - Tipo -->
							<NombreTercero>CAMPOLLO S.A .</NombreTercero>
							<UbicacionFisica>
								<Direccion>
									<Id>05125</Id>										<!-- Nueva validación: Dirección - Listas DANE -->
									<Departamento>ANTIOQUIA</Departamento>
									<Ciudad>MEDELLIN</Ciudad>							<!-- Nueva validación: Dirección - Listas DANE -->
									<SubdivisionPais>Antioquia</SubdivisionPais>		<!-- Nueva validación: Dirección - Listas DANE -->
									<SubdivisionPaisCodigo>05</SubdivisionPaisCodigo>	<!-- Nueva validación: Dirección - Listas DANE -->
									<ZonaPostal>050011</ZonaPostal>						<!-- Nueva validación: Zona postal -->
									<LineaDireccion>
										<TextoLinea>CR 29C N° 10C - 125</TextoLinea><!-- Nueva validación: Linea dirección -->
									</LineaDireccion>
									<Pais><!-- Cambia nombre: En el 2242 se denominaba "Country", ahora es País. -->
										<Codigo>CO</Codigo>
										<Nombre IdLenguaje="es">Colombia</Nombre><!-- Nueva validación: País -->
									</Pais>
								</Direccion>
							</UbicacionFisica>
							<EsquemaTributarioTercero>
								<NumeroIdTributario SmaIdNombre="31" SmaIdCodigo="9">804016671</NumeroIdTributario><!-- Nueva validación: 	Documento de identificación - Numero
																																			Documento de identificación - DV
																																			Documento de identificación - Tipo -->
								<NombreRegistrado>CAMPOLLO S.A .</NombreRegistrado>		<!-- Nueva validación: Razón social Tercero -->
								
								<NivelTributario ListaNombre="04">O-99</NivelTributario><!-- Nueva validación: 	Responsabilidades fiscales
																												Régimen tributario -->
								<DireccionParaImpuestos><!-- Nueva validación: Dirección para impuestos -->
									<Id>05125</Id>
									<Departamento>ANTIOQUIA</Departamento>
									<Ciudad>MEDELLIN</Ciudad>
									<SubdivisionPais>Antioquia</SubdivisionPais>
									<SubdivisionPaisCodigo>05</SubdivisionPaisCodigo>
									<!--<ZonaPostal>050011</ZonaPostal>-->
									<LineaDireccion>
										<TextoLinea>CR 29C N° 10C - 125</TextoLinea>
									</LineaDireccion>
									<Pais>
										<Codigo>CO</Codigo>
										<Nombre IdLenguaje="es">Colombia</Nombre>
									</Pais>
								</DireccionParaImpuestos>
								<EsquemaTributario>			<!-- Nueva validación: Esquema tributario Tercero -->	
									<Id>01</Id>				<!-- Nueva validación: Esquema tributario Tercero -->
									<Nombre>IVA</Nombre>	<!-- Nueva validación: Esquema tributario Tercero -->
								</EsquemaTributario>
							</EsquemaTributarioTercero>
							<EntidadLegalTercero>
								<NombreRegistrado>CAMPOLLO S.A .</NombreRegistrado><!-- Nueva validación: Razón social Tercero -->
								<NumeroIdLegal SmaIdNombre="31" SmaIdCodigo="9">804016671</NumeroIdLegal><!-- Nueva validación: Documento de identificación - Numero
																																Documento de identificación - DV
																																Documento de identificación - Tipo -->
								
								<EsquemaRegistroCorporativo><!-- Nueva validación: Registro corporativo Tercero -->
									<Nombre>6201</Nombre>	<!-- Nueva validación: Registro corporativo Tercero -->
								</EsquemaRegistroCorporativo>
							</EntidadLegalTercero>
							<Contacto>
								<Id>804016671-9</Id>
								<Nombre>CAMPOLLO S.A</Nombre>
								<Telefono>6572206</Telefono>
								<Email>auxiliar.logistica@campollo.net</Email>
							</Contacto>
						</Tercero>
					</TerceroClienteContable>
					<TerceroRpteFiscal>
						<IdTercero SmaIdNombre="31">804016671-9</IdTercero>
					</TerceroRpteFiscal>
				</Terceros>
				<Lineas>
					<Id>1</Id>									<!-- Nueva validación: Identificador de la línea -->
					<Cantidad CodUnidad="KGM">3</Cantidad>		<!-- Nueva validación: Linea - cantidad -->
					<ValorNeto IdMoneda="COP">93600</ValorNeto>	<!-- Nueva validación: Linea - valor neto -->
					
					<TotalImpuesto><!-- Nueva validación: Totales impuestos (Por línea y globales) -->
						<ValorImpuesto IdMoneda="COP">17184</ValorImpuesto>
						<IndicaEsSoloEvidencia>false</IndicaEsSoloEvidencia><!-- ¡Eliminar! -->
						<SubTotalImpuesto>
							<ValorImpuesto IdMoneda="COP">17184</ValorImpuesto><!-- Nueva validación: Linea - valor neto -->
							<BaseImponible IdMoneda="COP">93600</BaseImponible><!-- Nueva validación: Linea - valor neto -->
							<Porcentaje>1</Porcentaje><!-- ¡Eliminar! -->
							<CategoriaImpuesto>
								<Porcentaje>19.00</Porcentaje>					<!-- Nueva validación: Porcentaje impuestos -->
								<EsquemaTributario>
									<Id>01</Id>
									<Nombre>IVA</Nombre>
								</EsquemaTributario>
							</CategoriaImpuesto>
						</SubTotalImpuesto>
					</TotalImpuesto>
					<TotalRetenciones><!-- Nueva validación: Totales impuestos (Por línea y globales) -->
						<ValorImpuesto IdMoneda="COP">2340</ValorImpuesto>
						<IndicaEsSoloEvidencia>false</IndicaEsSoloEvidencia><!-- ¡Eliminar! -->
						<SubTotalImpuesto>
							<BaseImponible IdMoneda="COP">93600</BaseImponible>	<!-- Nueva validación: Linea - valor neto -->
							<ValorImpuesto IdMoneda="COP">2340</ValorImpuesto>	<!-- Nueva validación: Linea - valor neto -->
							<Porcentaje>1</Porcentaje><!-- !Eliminar¡ -->
							<CategoriaImpuesto>
								<Porcentaje>2.5</Porcentaje><!-- Nueva validación: Porcentaje impuestos -->
								<EsquemaTributario>
									<Id>06</Id>					<!-- Nueva validación: Tributos, impuestos y retenciones -->
									<Nombre>ReteFuente</Nombre>	<!-- Nueva validación: Tributos, impuestos y retenciones -->
								</EsquemaTributario>
							</CategoriaImpuesto>
						</SubTotalImpuesto>
					</TotalRetenciones>
					<Item>
						<Descripcion>Rebeca tricot basica</Descripcion><!-- Nueva validación: Descripción item de la linea. -->
						<IdItemEstandar>						<!-- Nueva validación: Código estándar para los productos. -->
							<Id SmaIdCodigo="999">Fev1656s</Id>	<!-- Nueva validación: Código estándar para los productos. -->
						</IdItemEstandar>
						<IdItemVendedor>
							<Id>20</Id>
						</IdItemVendedor>
					</Item>
					<Precio>
						<ValorPrecio IdMoneda="COP">31200</ValorPrecio>	<!-- Nueva validación: Precio -->
						<CantidadBase CodUnidad="KGM">3</CantidadBase>	<!-- Nueva validación: Linea - cantidad -->
					</Precio>
				</Lineas>
				<AgregadoComercial>
					<MediosDePago>
						<Id>1</Id>									<!-- Nueva validación: Medio de pago - forma de pago -->
						<CodigoMedioDePago>42</CodigoMedioDePago>	<!-- Nueva validación: Medio de pago - Id medio de pago -->
						<IdInstruccion>BBVA- convenio 11354 -Cuenta corriente No. 001304930100010375</IdInstruccion>
						<IdPago>134</IdPago>
					</MediosDePago>
					<MediosDePago>
						<Id>1</Id>									<!-- Nueva validación: Medio de pago - forma de pago -->
						<CodigoMedioDePago>42</CodigoMedioDePago>   <!-- Nueva validación: Medio de pago - Id medio de pago -->
						<IdInstruccion>Bancolombia -CONVENIO 12346- CUENTA CORRIENTE NO. 6544543847873</IdInstruccion>
						<IdPago>134</IdPago>
					</MediosDePago>
				</AgregadoComercial>
				<Referencias>
					<ReferenciaFacturacion>		<!-- Nueva validación: Referencia documentos a facturación -->
						<ReferenciaDocFactura>
							<Id>SETT7</Id>
							<UID SmaIdNombre="CUFE-SHA384">66468a55d88d61d48311dbf096f6c80872e2a7f109bec48ad6332bc64c4c8c19557a9d3bdd0ecbb9277911cae06461af</UID>
							<Fecha>2019-09-02</Fecha>
						</ReferenciaDocFactura>
					</ReferenciaFacturacion>
				</Referencias>
				<Notas>[VLetras Origen] SON: TRES MILLONES CUATROCIENTOS SESENTA Y OCHO MIL OCHOCIENTOS CINCUENTA PESOS M.L.</Notas>
				<Totales>
					<TotalImpuestos><!-- Nueva validación: Totales impuestos (Por línea y globales) -->
						<ValorImpuesto IdMoneda="COP">17184</ValorImpuesto>
						<IndicaEsSoloEvidencia>false</IndicaEsSoloEvidencia><!-- ¡Eliminar! -->
						<SubTotalImpuesto>
							<BaseImponible IdMoneda="COP">93600</BaseImponible><!-- Nueva validación: Linea - valor neto -->
							<ValorImpuesto IdMoneda="COP">17184</ValorImpuesto><!-- Nueva validación: Linea - valor neto -->
							<Porcentaje>1</Porcentaje><!-- ¡Eliminar! -->
							<CategoriaImpuesto>
								<Porcentaje>19.00</Porcentaje>					<!-- Nueva validación: Porcentaje impuestos -->
								<EsquemaTributario>
									<Id>01</Id>
									<Nombre>IVA</Nombre>
								</EsquemaTributario>
							</CategoriaImpuesto>
						</SubTotalImpuesto>
					</TotalImpuestos>
					
					<TotalRetenciones><!-- Nueva validación: Totales impuestos (Por línea y globales) -->
						<ValorImpuesto IdMoneda="COP">2340</ValorImpuesto>
						<IndicaEsSoloEvidencia>false</IndicaEsSoloEvidencia><!-- ¡Eliminar! -->
						<SubTotalImpuesto>
							<BaseImponible IdMoneda="COP">93600</BaseImponible>	<!-- Nueva validación: Linea - valor neto -->
							<ValorImpuesto IdMoneda="COP">2340</ValorImpuesto>	<!-- Nueva validación: Linea - valor neto -->
							<Porcentaje>1</Porcentaje><!-- !Eliminar¡ -->
							<CategoriaImpuesto>
								<Porcentaje>2.5</Porcentaje><!-- Nueva validación: Porcentaje impuestos -->
								<EsquemaTributario>
									<Id>06</Id>					<!-- Nueva validación: Tributos, impuestos y retenciones -->
									<Nombre>ReteFuente</Nombre>	<!-- Nueva validación: Tributos, impuestos y retenciones -->
								</EsquemaTributario>
							</CategoriaImpuesto>
						</SubTotalImpuesto>
					</TotalRetenciones>
					<TotalMonetario>
						<ValorBruto IdMoneda="COP">93600</ValorBruto>					<!-- Nueva validación: Subtotal documento -->
						<TotalMasImpuestos IdMoneda="COP">110784</TotalMasImpuestos>	<!-- Nueva validación: Total mas impuestos -->
						<ValorBaseImpuestos IdMoneda="COP">93600</ValorBaseImpuestos>	<!-- Nueva validación: Total base impuestos -->
						<ValorAPagar IdMoneda="COP">108444</ValorAPagar>				<!-- Nueva validación: Total a pagar -->
					</TotalMonetario>
				</Totales>
			</objetoDocumento>
		</soap:EnviarDocumentoElectronico>
	</soapenv:Body>
</soapenv:Envelope>